packages/sciPyFoam/sciPyFoam-0.4.1.tar.gz/sciPyFoam-0.4.1/example/cases/snappyHexMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          76;
        startFace       67758;
    }
    inlet
    {
        type            patch;
        nFaces          84;
        startFace       67834;
    }
    outlet
    {
        type            patch;
        nFaces          89;
        startFace       67918;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          95;
        startFace       68007;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21644;
        startFace       68102;
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          21812;
        startFace       89746;
    }
)

// ************************************************************************* //
