packages/sciPyFoam/sciPyFoam-0.4.1.tar.gz/sciPyFoam-0.4.1/example/cases/snappyHexMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06;

lx0 0;
ly0 0;
lz0 0;

lx1 1024;
ly1 728;
lz1 1;

vertices
(
    ($lx0 $ly0 $lz0)
    ($lx1 $ly0 $lz0)
    ($lx1 $ly1 $lz0)
    ($lx0 $ly1 $lz0)
    ($lx0 $ly0 $lz1)
    ($lx1 $ly0 $lz1)
    ($lx1 $ly1 $lz1)
    ($lx0 $ly1 $lz1)	
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
	    (4 5 6 7)
        );
    }
);

// ************************************************************************* //
